[BRSR_STRIKERIFLE_Conventional X2WeaponTemplate]
FriendlyName="Strike Rifle"
FriendlyNamePlural="Strike Rifles"
BriefSummary="The Strike Rifle is a more flexible alternative to the Sniper Rifle with a slightly bigger magazine. It is more accurate up close, but less accurate from afar. While it deals less damage than a Sniper Rifle, the Strike Rifle's light weight and low recoil grant it the No Scope ability, allowing the shooter to fire a standard shot that can't use squadsight or get critical hits for one non-turn-ending action once per turn. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Laser X2WeaponTemplate]
FriendlyName="Laser Strike Lance"
FriendlyNamePlural="Laser Strike Lances"
BriefSummary="Based on the advances in laser weapons tech we've achieved, the Laser Strike Lance boasts a substantial improvement in power over our conventional strike rifle. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Laser weapons receive bonus aim. \n<Bullet/> Laser Strike Rifles are substantially more effective and accurate than their conventional precursors. \n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Magnetic X2WeaponTemplate]
FriendlyName="Mag Strike Rifle"
FriendlyNamePlural="Mag Strike Rifles"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, the Mag Strike Rifle boasts a substantial improvement in power over our conventional strike rifle. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Mag Strike Rifles do more damage than their conventional or laser precursors.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Coil X2WeaponTemplate]
FriendlyName="Coil Strike Rifle"
FriendlyNamePlural="Coil Strike Rifles"
BriefSummary="A powerful, coil-tech strike rifle that outperforms the Mag Strike Rifle in power output. Can punch through enemy armor. Includes the No Scope ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Coil weapons automatically pierce 1 enemy armor.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_STRIKERIFLE_Beam X2WeaponTemplate]
FriendlyName="Plasma Strike Lance"
FriendlyNamePlural="Plasma Strike Lances"
BriefSummary="The ultimate strike rifle model, the Plasma Strike Lance integrates the aliens' plasma weapons technology to powerful effect. Includes the No Scope ability. Can equip underbarrel weapons, standard bayonets and powered bayonets."
TacticalText="<Bullet/> Plasma weapons cause targets to take 1 additional damage on future hits.\n<Bullet/> Plasma Strike Lances are the most powerful strike rifles on Earth.\n<Bullet/> Requires two actions to fire or Overwatch. \n<Bullet/>Takes less time to infiltrate with than a standard sniper rifle."
AbilityDescName="strike rifle"

[BRSR_BATTLERIFLE_Conventional X2WeaponTemplate]
FriendlyName="Battle Rifle"
FriendlyNamePlural="Battle Rifles"
BriefSummary="The Battle Rifle is an alternative to the Cannon that offers superior control due to its smaller profile. It is more accurate than a Cannon up close, but less so at range. While its damage and magazine size are both lower than the Cannon's, the Battle Rifle grants the Russian Roulette ability, which lets the user make another Overwatch shot if their previous attempt misses. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Laser X2WeaponTemplate]
FriendlyName="Laser Pulser"
FriendlyNamePlural="Laser Pulsers"
BriefSummary="Based on the advances in laser weapons tech we've achieved, the Laser Pulser boasts a substantial improvement in power over our conventional battle rifle. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Laser weapons receive bonus aim. \n<Bullet/> Laser Pulsers are substantially more effective and accurate than their conventional precursors. \n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Magnetic X2WeaponTemplate]
FriendlyName="Mag Battle Rifle"
FriendlyNamePlural="Mag Battle Rifles"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, the Mag Battle Rifle boasts a substantial improvement in power over our conventional strike rifle. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Mag Battle Rifles do more damage than their conventional or laser precursors.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Coil X2WeaponTemplate]
FriendlyName="Coil Battle Rifle"
FriendlyNamePlural="Coil Battle Rifles"
BriefSummary="A powerful, coil-tech battle rifle that outperforms the Mag Battle Rifle in power output. Can punch through enemy armor. Includes the Russian Roulette ability. Can equip underbarrel weapons and standard bayonets."
TacticalText="<Bullet/> Coil weapons automatically pierce 1 enemy armor.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_BATTLERIFLE_Beam X2WeaponTemplate]
FriendlyName="Plasma Cycler"
FriendlyNamePlural="Plasma Cyclers"
BriefSummary="The ultimate battle rifle model, the Plasma Cycler integrates the aliens' plasma weapons technology to powerful effect. Includes the Russian Roulette ability. Can equip underbarrel weapons, standard bayonets and powered bayonets."
TacticalText="<Bullet/> Plasma weapons cause targets to take 1 additional damage on future hits.\n<Bullet/> Plasma Cyclers are the most powerful battle rifles on Earth.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of specialized training. \n<Bullet/>Takes less time to infiltrate with than a standard cannon."
AbilityDescName="battle rifle"

[BRSR_RussianRoulette X2AbilityTemplate]
LocFriendlyName="Russian Roulette"
LocLongDescription="When on Overwatch, if your shot misses, another shot will be taken as long as ammo is available. Only affects the primary weapon, not secondaries or pistols."
LocHelpText="When on Overwatch, if your shot misses, another shot will be taken as long as ammo is available."
LocFlyOverText="Russian Roulette"
LocPromotionPopupText="<Bullet/> Shots will continue to be taken until a hit is made, ammo runs out or there are no more targets to shoot at.\n<Bullet/> Critical hits and grazes both are considered \"hits\" for the purposes of this ability.\n<Bullet/> Only affects regular Overwatch; Return Fire and similar abilities that grant other kinds of reaction shots are unaffected.\n<Bullet/> This soldier won't continue to make Overwatch shot attempts if their Overwatch is removed, e.g. by taking damage, being suppressed or becoming disoriented."

[BRSR_NoScope X2AbilityTemplate]
LocFriendlyName="No Scope"
LocLongDescription="Fire a standard shot for one action that doesn't end the turn, but can't use Squadsight or get critical hits. Can be used once per turn."
LocHelpText="Fire a standard shot for one action that doesn't end the turn, but can't use Squadsight or get critical hits."
LocFlyOverText="No Scope"
LocPromotionPopupText="<Bullet/> No Scope not ending the turn and only needing 1 action makes it combine well with many Sharpshooter abilities, such as Death From Above or Snap Shot, as well as with other weapons such as a pistol or a Holotargeter."